import numpy as np
import matplotlib.pyplot as plt

t1 = [0, 0.0167, 0.0333, 0.05, 0.0667, 0.0833, 0.1, 0.117, 0.133, 0.15, 0.167, 0.183, 0.2,
0.217, 0.233, 0.25, 0.267, 0.283, 0.3, 0.317, 0.333, 0.35, 0.367, 0.383, 0.4, 0.417, 0.433,
0.45, 0.467, 0.483, 0.5, 0.517, 0.533, 0.55, 0.567, 0.583, 0.6, 0.617, 0.633, 0.65, 0.667, 0.683,
0.7, 0.717, 0.733, 0.75, 0.767, 0.783, 0.8, 0.817, 0.833, 0.85, 0.867]

x1 = [0.00194, 0.0517, 0.0872, 0.116, 0.151, 0.183, 0.219, 0.258, 0.293, 0.322, 0.357, 0.393, 0.421,
0.457, 0.496, 0.535, 0.567, 0.592, 0.631, 0.67, 0.713, 0.734, 0.773, 0.805, 0.848, 0.887, 0.915,
0.944, 0.986, 1.022, 1.05, 1.079, 1.121, 1.153, 1.185, 1.221, 1.249, 1.285, 1.32, 1.349, 1.381, 1.413,
1.448, 1.484, 1.512, 1.548, 1.58, 1.612, 1.64, 1.665, 1.697, 1.726, 1.765]

y1 = [0.0085, 0.044, 0.0831, 0.126, 0.161, 0.19, 0.222, 0.254, 0.279, 0.303, 0.325, 0.346, 0.36,
0.371, 0.382, 0.392, 0.396, 0.396, 0.396, 0.396, 0.389, 0.385, 0.375, 0.364, 0.346, 0.328,
0.307, 0.286, 0.261, 0.236, 0.211, 0.176, 0.144, 0.104, 0.0654, 0.0227, -0.0199, -0.0626, -0.112,
-0.162, -0.212, -0.265, -0.326, -0.386, -0.45, -0.51, -0.578, -0.642, -0.709, -0.78, -0.855, -0.933, -0.994]

g = 9.81

def function(t, x, y, title):

    t = np.array(t, dtype=float)
    x = np.array(x, dtype=float)
    y = np.array(y, dtype=float)

#приближения (центральная разность)
    h = t1[2] - t1[0]
    v0x = (x1[2] - x1[0]) / h
    v0y = (y1[2] - y1[0]) / h
    v0 = np.sqrt(v0x ** 2 + v0y ** 2)
    theta_r = np.atan2(v0y, v0x)
    theta_d = np.degrees(theta_r)

    print("шаг по времени =", h,"с")
    print("v0x =", v0x,"м/с")
    print("v0y =", v0y,"м/с")
    print("v0 =", v0,"м/с")
    print("угол =", theta_d,"градусов")

#аналитически точка падения, время падения и время максимума
    t_max = v0 * np.sin(theta_r) / g
    t_pad = 2 * v0 * np.sin(theta_r) / g
    x_pad = v0 * np.cos(theta_r) * t_pad

#экспериментально
    x_pad_exp = max(x1)
    t_pad_exp = t1[52]
    t_max_exp = t1[17]

#абсолютная погрешность
    print("погрешность времени максимума =",t_max-t_max_exp)
    print("погрешность точки падения =",x_pad-x_pad_exp)
    print("погрешность времени падения =",t_pad-t_pad_exp)

    print("При проведении эксперимента никто не пострадал!!!")

    plt.figure()
    plt.plot(x, y, marker='o', linestyle='-', label="Экспериментальная траектория")
    plt.scatter(x_pad, 0, s=80, label="Дальность (аналитика)")
    plt.scatter(x_pad_exp, 0, s=80, label="Дальность (эксперимент)")
    plt.xlabel("x, м")
    plt.ylabel("y, м")
    plt.title(title)
    plt.grid(True)
    plt.legend()
    plt.show()

function(t1, x1, y1, "Эксперимент 1")