import numpy as np
import matplotlib.pyplot as plt

t2 = [0, 0.0167, 0.0333, 0.05, 0.0667, 0.0833, 0.1, 0.117, 0.133, 0.15, 0.167, 0.183, 0.2, 0.217, 0.233,
0.25, 0.267, 0.283, 0.3, 0.317, 0.333, 0.35, 0.367, 0.383, 0.4, 0.417, 0.433, 0.45, 0.467, 0.483,
0.5, 0.517, 0.533, 0.55, 0.567, 0.583, 0.6, 0.617, 0.633, 0.65, 0.667, 0.683, 0.7, 0.717, 0.733]

x2 = [0.0122, 0.0355, 0.0588, 0.0822, 0.102, 0.129, 0.156, 0.179, 0.203, 0.226, 0.253, 0.28, 0.308, 0.331, 0.358,
0.381, 0.409, 0.436, 0.463, 0.49, 0.518, 0.541, 0.568, 0.595, 0.623, 0.654, 0.681, 0.704, 0.731, 0.759,
0.786, 0.809, 0.836, 0.864, 0.891, 0.918, 0.937, 0.968, 0.996, 1.015, 1.042, 1.077, 1.105, 1.124, 1.132]

y2 = [-0.00511, 0.0299, 0.061, 0.0843, 0.115, 0.135, 0.15, 0.17, 0.181, 0.193, 0.201, 0.209, 0.209, 0.209, 0.209,
0.209, 0.201, 0.189, 0.178, 0.166, 0.146, 0.131, 0.104, 0.0843, 0.061, 0.0338, -0.00122, -0.0323, -0.0712, -0.114,
-0.149, -0.199, -0.242, -0.289, -0.339, -0.39, -0.444, -0.507, -0.565, -0.627, -0.697, -0.763, -0.841, -0.911, -0.942]

g = 9.81

def function(t, x, y, title):

    t = np.array(t, dtype=float)
    x = np.array(x, dtype=float)
    y = np.array(y, dtype=float)

#приближения (центральная разность)
    h = t2[2] - t2[0]
    v0x = (x2[2] - x2[0]) / h
    v0y = (y2[2] - y2[0]) / h
    v0 = np.sqrt(v0x ** 2 + v0y ** 2)
    theta_r = np.atan2(v0y, v0x)
    theta_d = np.degrees(theta_r)

    print("шаг по времени =", h,"с")
    print("v0x =", v0x,"м/с")
    print("v0y =", v0y,"м/с")
    print("v0 =", v0,"м/с")
    print("угол =", theta_d,"градусов")

#аналитически точка падения, время падения и время максимума
    t_max = v0 * np.sin(theta_r) / g
    t_pad = 2 * v0 * np.sin(theta_r) / g
    x_pad = v0 * np.cos(theta_r) * t_pad

#экспериментально
    x_pad_exp = max(x2)
    t_pad_exp = t2[44]
    t_max_exp = t2[13]

#абсолютная погрешность
    print("погрешность времени максимума =",t_max-t_max_exp)
    print("погрешность точки падения =",x_pad-x_pad_exp)
    print("погрешность времени падения =",t_pad-t_pad_exp)

    print("При проведении эксперимента никто не пострадал!!!")

    plt.figure()
    plt.plot(x, y, marker='o', linestyle='-', label="Экспериментальная траектория")
    plt.scatter(x_pad, 0, s=80, label="Дальность (аналитика)")
    plt.scatter(x_pad_exp, 0, s=80, label="Дальность (эксперимент)")
    plt.xlabel("x, м")
    plt.ylabel("y, м")
    plt.title(title)
    plt.grid(True)
    plt.legend()
    plt.show()

function(t2, x2, y2, "Эксперимент 2")


